ХМНПФ_Общее/Documents/уп_ОткрытиеДоговораОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ОткрытиеДоговораОПС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерНовогоДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормаВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ФормыВыплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПредыдущийСтраховщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаЗаведенияДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Правопреемники</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СостоянияДоговораОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияДоговораОПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостоянияДоговоровОПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ПредыдущиеСтраховщикиПоДоговорамОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПредыдущиеСтраховщикиПоДоговорамОПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПредыдущийСтраховщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/ФИОФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ФИОФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Инициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_СостоянияДоговоровОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияДоговоровОПС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заключен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжиданиеПодтвержденияПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжиданиеПоступленияВзносов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НакопительныйПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатнойПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПриостановленПоОтказуИзПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодготовкаКЗакрытию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатыПриостановлены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачисленияПриостановлены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиновременнаяВыплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбязательстваВыполнены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_Анулирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ФизическиеЛица</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтраховойНомерПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>уп_ДатаСмерти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МестоРожденияПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>240</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>240</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>уп_ФИОВРеестреПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ХМНПФ_Общее/Catalogs/уп_ДоговорыОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ДоговорыОПС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаЗаключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаНазначенияНЧТП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СрокНЧТППриНазначении</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_ОткрытиеДоговораОПС/Ext/ObjectModule.bsl
Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 06.07.2016 ШадринАВ // ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №396
	// +ХМНПФ 01.03.17 Кучеров// Новая Функция ХМ_ПечатьWeb()
	// +ХМНПФ 01.03.17 Кучеров// Новая Процедура ХМ_ДобавитьОшибку
	// ХМНПФ 15.04.17 Кучеров // Собираем ошибки при проведении документа
КонецПроцедуры

#Если Клиент Тогда
	
// +ХМНПФ 28.02.17 Функция ПечатьДоговора15052012(МассивОбъектов, ИмяМакета) Кучеров // добавлена опция Экспорт для возможности получения печатной формы из веб сервисов
&ИзменениеИКонтроль("ПечатьДоговора15052012")
Функция ХМПечатьДоговора15052012(ИмяМакета) Экспорт 

	ТабДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет(ИмяМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("Договор");
	ОбластьМакета.Параметры.НомерДок = НомерНовогоДоговора;

	////находим ИНН,дату и номер лицензии ОПС для выбранной организации
	ИНН = Организация.ИНН;
	ДатаЛицензии = Организация.уп_ДатаЛицензииОПС;
	НомерЛицензииОПС = Организация.уп_НомерЛицензииОПС;
	ОбластьМакета.Параметры.ДатаЛицензии = формат(ДатаЛицензии,"ДЛФ=Д");
	ОбластьМакета.Параметры.НомерЛицензииОПС = НомерЛицензииОПС;

	//находим номер расчетного счета, наименование банка, город нахождения банка по выбранной организации
	// БИК и корреспонд.счет банка
	СписокБанковскиеРеквизиты =ВосстановитьЗначение("БанковскиеРеквизиты");
	ОбластьМакета.Параметры.СтрОрганизация = СокрЛП(Организация.НаименованиеПолное);
	Если ТипЗнч (СписокБанковскиеРеквизиты) = Тип ("СписокЗначений")  Тогда
		ОбластьМакета.Параметры.КоррСчет = "К/с "+СокрЛП(СписокБанковскиеРеквизиты[1].Значение);
		ОбластьМакета.Параметры.РасчетныйСчет = "р/с №"+СокрЛП(СписокБанковскиеРеквизиты[3].Значение)+
		", в "+СокрЛП(СписокБанковскиеРеквизиты[0].Значение)+" г."+СокрЛП(СписокБанковскиеРеквизиты[2].Значение);
		ОбластьМакета.Параметры.БИК =  "БИК "+СокрЛП(СписокБанковскиеРеквизиты[4].Значение);
	КонецЕсли;

	//юридический адрес организации
	СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Организация.Ссылка, дата);
	ОбластьМакета.Параметры.ПредставлениеФактАдресаНПФ1 = СведенияОбОрганизации.ФактическийАдрес;

	/////находим пол, дату и место рождения застрахованного лица		
	МестоРождения = Участник.уп_ФизЛицо.МестоРождения;
	ДатаРождения = Участник.уп_ФизЛицо.ДатаРождения;   
	ОбластьМакета.Параметры.Пол = "Пол: "+Участник.уп_ФизЛицо.Пол;
	ОбластьМакета.Параметры.ФИОприРождении = Участник.уп_ФИОПриРождении;
	ОбластьМакета.Параметры.СтраховойНомерПФР = Участник.уп_ФизЛицо.СтраховойНомерПФР;
	ОбластьМакета.Параметры.ИНН ="ИНН "+ИНН;

	//убираем 1 символ в строке место рождения, меняем запятые на пробелы 
	Ноль = КодСимвола(МестоРождения,1);
	Запятая = КодСимвола(МестоРождения,2);
	Ноль = Символ (Ноль);
	Запятая = Символ (Запятая);
	Пробел = " ";
	МестоРождения = СтрЗаменить(МестоРождения,Ноль,Пробел); 
	МестоРождения = СтрЗаменить(МестоРождения,Запятая,Пробел);
	ОбластьМакета.Параметры.ДатаРождения = "Дата рождения: "+формат(ДатаРождения,"ДЛФ=Д");
	ОбластьМакета.Параметры.МестоРождения = "Место рождения: "+СокрЛП(МестоРождения);
	//ОбластьМакета.Параметры.ДатаРожденияИМесто = формат(ДатаРождения,"ДЛФ=Д")+" "+СокрЛП(МестоРождения);

	Если ИмяМакета = "Договор03062013" Тогда
		//Находим дату и место рождения и пол
		ОбластьМакета.Параметры.ДатаМестоПол ="Дата рождения: "+Лев(ДатаРождения,10)+", место рождения: "+СокрЛП(МестоРождения)+", Пол: "+Участник.уп_ФизЛицо.Пол;
		ОбластьМакета.Параметры.ЧислоПодписанияДоговора = Лев(формат(Дата,"ДЛФ=Д"),2);
		Год = Прав(формат(Дата,"ДЛФ=Д"),7);
		ДлинаДаты = СтрДлина(формат(Дата,"ДЛФ=ДД"));
		ОбластьМакета.Параметры.ДатаПодписанияДоговора = сред(формат(Дата,"ДЛФ=ДД"),3,ДлинаДаты);
	КонецЕсли;	


	//находим паспортные данные застрахованного лица
	ПаспортныеДанные = РегистрыСведений.ДокументыФизическихЛиц.ПолучитьПоследнее(Дата,Новый Структура("ФизЛицо, ВидДокумента", Участник.уп_ФизЛицо, Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ));
	СерияПаспорта = ПаспортныеДанные.Серия;
	НомерПаспорта = ПаспортныеДанные.Номер;
	ДатаВыдачиПаспорта = ПаспортныеДанные.ДатаВыдачи;
	КемВыданПаспорт = СокрЛП(ПаспортныеДанные.КемВыдан);
	ОбластьМакета.Параметры.ПаспортСерияНомер = "Паспорт "+СерияПаспорта+" №"+НомерПаспорта;
	ОбластьМакета.Параметры.ДатаВыдачиПаспорта = "Дата выдачи: "+формат(ДатаВыдачиПаспорта,"ДЛФ=Д");;
	ОбластьМакета.Параметры.КемВыданПаспорт = "Кем выдан: "+КемВыданПаспорт;


	// создаем запрос для поиска в регистре сведений контактная информация
	// с параметрами юридический адрес контрагента, самого контрагента и отображаем в поле макета
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтактнаяИнформация.Ссылка КАК Объект,
	|	КонтактнаяИнформация.Вид,
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &ФИОЗастрахованногоЛица
	|	И КонтактнаяИнформация.Вид.Ссылка = &ВидАдреса";

	Запрос.УстановитьПараметр("ФИОЗастрахованногоЛица", участник.уп_ФизЛицо);
	Запрос.УстановитьПараметр("ВидАдреса",Справочники.ВидыКонтактнойИнформации.ТелефонДомашнийФизическиеЛица);
	Результат = Запрос.Выполнить();
	ВыборкаАдресЮрЗастрахованногоЛица = Результат.Выбрать();
	Если ВыборкаАдресЮрЗастрахованногоЛица.Следующий() Тогда
		ОбластьМакета.Параметры.ПредствлениеФактАдресаЗастрахованногоЛица = ВыборкаАдресЮрЗастрахованногоЛица.Представление;
	КонецЕсли;

	// создаем запрос для поиска в регистре сведений контактная информация
	// с параметрами юридический адрес контрагента, самого контрагента и отображаем в поле макета
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтактнаяИнформация.Ссылка КАК Объект,
	|	КонтактнаяИнформация.Вид,
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &ФИОЗастрахованногоЛица
	|	И КонтактнаяИнформация.Вид.Ссылка = &ВидАдреса";

	Запрос.УстановитьПараметр("ФИОЗастрахованногоЛица", участник.уп_ФизЛицо);
	Запрос.УстановитьПараметр("ВидАдреса",Справочники.ВидыКонтактнойИнформации.ТелефонДомашнийФизическиеЛица);
	Результат = Запрос.Выполнить();
	ВыборкаАдресЮрЗастрахованногоЛица = Результат.Выбрать();
	Если ВыборкаАдресЮрЗастрахованногоЛица.Следующий() Тогда
		ОбластьМакета.Параметры.Телефон = "Телефон:"+ВыборкаАдресЮрЗастрахованногоЛица.Представление;
	КонецЕсли;

	// находим ответственных лиц организации на момент подписания договора
	ОтветственноеЛицоОрг = РегистрыСведений.ОтветственныеЛицаОрганизаций.ПолучитьПоследнее(Дата, Новый Структура("СтруктурнаяЕдиница, ОтветственноеЛицо",Организация , Перечисления.ОтветственныеЛицаОрганизаций.Руководитель));
	Должность = ОтветственноеЛицоОрг.Должность;
	ФизическоеЛицо = ОтветственноеЛицоОрг.ФизическоеЛицо;


	СведенияОбОтветственном = уп_ПользовательскиеНастройкиСервер.ПолучитьСведенияОбУполномоченномЛице(Документы.уп_ОткрытиеДоговораОПС.ПустаяСсылка(),Организация,Филиал,Пользователи.ТекущийПользователь(),"Договор15052012",Дата);
	Должность = СведенияОбОтветственном.Должность;
	ФИООтветственного = СведенияОбОтветственном.Фамилия+" "+Лев(СведенияОбОтветственном.Имя,1)+"."+Лев(СведенияОбОтветственном.Отчество,1)+".";


	ОбластьМакета.Параметры.ПодписьФонда = СокрЛП(Должность)+" "+ФИООтветственного;


	//получаем из сохранненого списка значений данные в  макет
	СписокРеквизитыДляДоговоровОПС =ВосстановитьЗначение("РеквизитыДляДоговоровОПС");
	Если ТипЗнч (СписокРеквизитыДляДоговоровОПС) = Тип ("СписокЗначений")  Тогда
		ОбластьМакета.Параметры.ДолжностноеЛицоРодитПадеж = СписокРеквизитыДляДоговоровОПС[3].Значение;
		//ОбластьМакета.Параметры.НаименованиеЛицензирующегоОргана = СписокРеквизитыДляДоговоровОПС[4].Значение;
		Если  СписокРеквизитыДляДоговоровОПС[0].Значение = 0 Тогда 
			ОбластьМакета.Параметры.НеБолее15Процентов = "15%";  
		Иначе
			ОбластьМакета.Параметры.НеБолее15Процентов = Строка(СписокРеквизитыДляДоговоровОПС[0].Значение)+"%"; 
		КонецЕсли;
		//Если  СписокРеквизитыДляДоговоровОПС[1].Значение = 0 Тогда 
		//	ОбластьМакета.Параметры.НеПозднее10Дней = "10 дней";  
		//Иначе
		//	ОбластьМакета.Параметры.НеПозднее10Дней = Строка(СписокРеквизитыДляДоговоровОПС[1].Значение)+" дней";
		//КонецЕсли;
		Если ИмяМакета = "Договор15052012" Тогда
			Если  СписокРеквизитыДляДоговоровОПС[2].Значение = 0 Тогда 
				ОбластьМакета.Параметры.НеПозднее5Дней = "5 дней";  
			Иначе
				ОбластьМакета.Параметры.НеПозднее5Дней = Строка(СписокРеквизитыДляДоговоровОПС[2].Значение)+" дней";
			КонецЕсли;
		КонецЕсли;
		Если СписокРеквизитыДляДоговоровОПС.Количество()>10 Тогда
			Если СписокРеквизитыДляДоговоровОПС[11].Значение = "" Тогда
				ОбластьМакета.Параметры.МестоЗаключения = СведенияОбОрганизации.ФактическийАдрес;
			Иначе
				ОбластьМакета.Параметры.МестоЗаключения=СписокРеквизитыДляДоговоровОПС[11].Значение;
			КонецЕсли;
		Иначе
			ОбластьМакета.Параметры.МестоЗаключения = СведенияОбОрганизации.ФактическийАдрес;
		КонецЕсли;
	Иначе
		ОбластьМакета.Параметры.НеБолее15Процентов = "15%";  
		//ОбластьМакета.Параметры.НеПозднее10Дней = "10 дней"; 
		Если ИмяМакета = "Договор15052012" Тогда
			ОбластьМакета.Параметры.НеПозднее5Дней = "5 дней"; 
		КонецЕсли;
		ОбластьМакета.Параметры.МестоЗаключения = СведенияОбОрганизации.ФактическийАдрес;
	КонецЕсли;     

	//заполняем остальные поля макета из реквизитов документа
	ОбластьМакета.Параметры.Участник = Участник.НаименованиеПолное;
	ОбластьМакета.Параметры.ФИОЗастрахованногоЛица1 = Участник.НаименованиеПолное;
	//ОбластьМакета.Параметры.ФИОЗастрахованногоЛица2 = ФизическиеЛицаКлиентСервер.ФамилияИнициалыФизЛица(Участник.НаименованиеПолное);
	ОбластьМакета.Параметры.ФИОЗастрахованногоЛица2 = Участник.НаименованиеПолное;
	//ОбластьМакета.Параметры.ФИОЗастрахованногоЛица4 = ФизическиеЛицаКлиентСервер.ФамилияИнициалыФизЛица(Участник.НаименованиеПолное);
	Если ИмяМакета = "Договор15052012" Тогда
		ОбластьМакета.Параметры.ДатаПодписанияДоговора = формат(Дата,"ДЛФ=Д");
	КонецЕсли;
	ОбластьМакета.Параметры.СтрОрганизация = Организация.НаименованиеПолное;
	ОбластьМакета.Параметры.Телефоны = "Телефоны: "+СведенияОбОрганизации.Телефоны;

	ТабДокумент.Вывести(ОбластьМакета);

	ТабДокумент.ПолеСверху         = 0;
	ТабДокумент.ПолеСлева          = 10;
	ТабДокумент.ПолеСнизу          = 0;
	ТабДокумент.ПолеСправа         = 10;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;

	Возврат ТабДокумент;

КонецФункции

#КонецЕсли

&После("ПриУстановкеНовогоНомера")
Процедура ХМ_ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	ХМ_ПодпискиНаСобытия.ХМ_НомераРешенийПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);	
КонецПроцедуры

&ИзменениеИКонтроль("ПроверитьЗаполнениеРеквизитов")
Функция РасшОбщ_ПроверитьЗаполнениеРеквизитов(Заголовок = "")
	Отказ = Ложь;
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Не указана организация.",,Заголовок);
		Отказ = Истина;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Участник) Тогда
		уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Не указано застрахованное лицо.",,Заголовок);
		Отказ = Истина;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Участник.уп_ФизЛицо.СтраховойНомерПФР) Тогда
		#Вставка
		// +ХМНПФ 15.04.17 Кучеров // ПроверитьЗаполнениеРеквизитов() // Собираем ошибки при проведении документа
		ХМ_ДобавитьОшибку("У застрахованного лица не указан страховой номер ПФР.");
		// -ХМНПФ 15.04.17 Кучеров // ПроверитьЗаполнениеРеквизитов() // Собираем ошибки при проведении документа
		#КонецВставки
		уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("У застрахованного лица не указан страховой номер ПФР.",,Заголовок);
		Отказ = Истина;
	Иначе
		//проверим номер ПФР на соответствие требованиям
		Соответствует = уп_ОсновнаяПоставкаСервер.СтраховойНомерПФРСоответствуетТребованиям(Участник.уп_ФизЛицо.СтраховойНомерПФР);
		Если Соответствует = Ложь Тогда
			#Вставка
			// +ХМНПФ 15.04.17 Кучеров // ПроверитьЗаполнениеРеквизитов() // Собираем ошибки при проведении документа
			ХМ_ДобавитьОшибку("Страховой номер ПФР не соответствует требованиям.");
			// -ХМНПФ 15.04.17 Кучеров // ПроверитьЗаполнениеРеквизитов() // Собираем ошибки при проведении документа
			#КонецВставки
			уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Страховой номер ПФР не соответствует требованиям.");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Участник.уп_ФИОПриРождении) Тогда
		уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("У застрахованного лица не указано ФИО при рождении.",,Заголовок);
		МассивСообщений.Добавить("У застрахованного лица не указано ФИО при рождении.");
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Участник.уп_ФизЛицо.МестоРождения) Тогда
		уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("У застрахованного лица не указано место рождения.",,Заголовок);
		МассивСообщений.Добавить("У застрахованного лица не указано место рождения.");
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Не указан ответственный.",,Заголовок);
		Отказ = Истина;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДатаЗаведенияДоговора) Тогда
		уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Не указана дата заведения договора.",,Заголовок);
		Отказ = Истина;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(НомерНовогоДоговора) Тогда
		уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Не указан номер договора.",,Заголовок);
		Отказ = Истина;
	КонецЕсли;
	//Если ЗначениеНеЗаполнено(Филиал) Тогда
	//	СообщитьОбОшибке("Не указан филиал.",,Заголовок);
	//	Отказ = Истина;
	//КонецЕсли;
	//Для каждого Правопреемник из Правопреемники Цикл
	//	Если НЕ ЗначениеЗаполнено(Правопреемник.СтепеньРодства) Тогда
	//		уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Не заполнена степерь родства у правоприемника "
	//			+Правопреемник.Фамилия+" "+Правопреемник.Имя+" "+Правопреемник.Отчество,,Заголовок);
	//		Отказ=Истина;
	//	КонецЕсли;
	//КонецЦикла;
	Возврат Отказ;
КонецФункции	

&ИзменениеИКонтроль("ПроверитьНаличиеДоговоровОПС")
Функция РасшОбщ_ПроверитьНаличиеДоговоровОПС(Заголовок = "")
	Отказ = Ложь;
	
	ПравилоПроверки = СтруктураПараметров.ПроверкаНаличияДоговораОПС;
	
	Если ПравилоПроверки = 2 Тогда
		Возврат Отказ;
	Иначе 	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СостоянияДоговораОПССрезПоследних.ДоговорОПС,
	|	СостоянияДоговораОПССрезПоследних.Состояние
	|ИЗ
	|	РегистрСведений.уп_СостоянияДоговораОПС.СрезПоследних(
	|		&Дата,
	|		ДоговорОПС.Организация = &Организация
	|			И ДоговорОПС.Участник = &Участник
	|			И ДоговорОПС.Ссылка <> &ДоговорОПС) КАК СостоянияДоговораОПССрезПоследних
	|ГДЕ
	|	СостоянияДоговораОПССрезПоследних.Состояние В(&СписокОткрытых)";
	
	//Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
	Если ПравилоПроверки = 1 Тогда
		Запрос.УстановитьПараметр("Дата", КонецГода(ДатаЗаведенияДоговора));
	Иначе
		Запрос.УстановитьПараметр("Дата", КонецГода(Дата));
	КонецЕсли;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Участник", Участник);
	Запрос.УстановитьПараметр("ДоговорОПС", ДоговорОПС);
	СписокОткрытых = Новый СписокЗначений;
	СписокОткрытых.Добавить(Перечисления.уп_СостоянияДоговоровОПС.Заключен);
	СписокОткрытых.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ОжиданиеПодтвержденияПФР);
	СписокОткрытых.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ОжиданиеПоступленияВзносов);
	СписокОткрытых.Добавить(Перечисления.уп_СостоянияДоговоровОПС.НакопительныйПериод);
	СписокОткрытых.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ВыплатнойПериод);
	СписокОткрытых.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ВыплатыПриостановлены);
	СписокОткрытых.Добавить(Перечисления.уп_СостоянияДоговоровОПС.НачисленияПриостановлены);
	СписокОткрытых.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ПодготовкаКЗакрытию);
	////ЕдиноврВыпл
	//СписокОткрытых.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ЕдиновременнаяВыплата);
	//СписокОткрытых.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ОбязательстваВыполнены);
	////~ЕдиноврВыпл
	Запрос.УстановитьПараметр("СписокОткрытых", СписокОткрытых);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		#Вставка
		// +ХМНПФ 15.04.17 Кучеров // ПроверитьНаличиеДоговоровОПС() // Собираем ошибки при проведении документа
		ХМ_ДобавитьОшибку("У Участника "+Участник.Наименование+" код "+Участник.Код+" уже есть незакрытый на конец года договор ОПС №"+Выборка.ДоговорОПС.Код+" сост. "+Выборка.Состояние);
		// -ХМНПФ 15.04.17 Кучеров // ПроверитьНаличиеДоговоровОПС() // Собираем ошибки при проведении документа
		#КонецВставки
	    уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("У Участника "+Участник.Наименование+" код "+Участник.Код+" уже есть незакрытый на конец года договор ОПС №"+Выборка.ДоговорОПС.Код+" сост. "+Выборка.Состояние,,Заголовок);
		Отказ = Истина;
	КонецЦикла;
	КонецЕсли;
	Возврат Отказ;
КонецФункции	

&ИзменениеИКонтроль("ПроверитьНомерДоговораОПС")
Функция РасшОбщ_ПроверитьНомерДоговораОПС(Заголовок = "")
	//КонтрольУникальности = СтруктураПараметров.КонтрольНомеровДоговоровОПСГод;
	КонтрольУникальности = СтруктураПараметров.КонтрольНумерацииДоговоров;
	Если КонтрольУникальности = 1 Тогда
		// выберем элементы с этим же номером в текущем году
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	уп_ДоговорыОПС.Ссылка,
		               |	уп_ДоговорыОПС.Код
		               |ИЗ
		               |	Справочник.уп_ДоговорыОПС КАК уп_ДоговорыОПС
		               |ГДЕ
		               |	уп_ДоговорыОПС.ДатаЗаключения >= &НачГода
		               |	И уп_ДоговорыОПС.ДатаЗаключения <= &КонГода
		               |	И уп_ДоговорыОПС.Код = &Код";
		
		Запрос.УстановитьПараметр("Код", СокрЛП(НомерНовогоДоговора));
		Запрос.УстановитьПараметр("НачГода", НачалоГода(Дата));
		Запрос.УстановитьПараметр("КонГода", КонецГода(Дата));
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
		    НайденнаяСсылка = Выборка.Ссылка;
		Иначе
			НайденнаяСсылка = Справочники.уп_ДоговорыОПС.ПустаяСсылка();
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ДоговорОПС) Тогда
			Если НайденнаяСсылка<>Справочники.уп_ДоговорыОПС.ПустаяСсылка() Тогда
				#Вставка
				// +ХМНПФ 15.04.17 Кучеров // ПроверитьНомерДоговораОПС() // Собираем ошибки при проведении документа
				ХМ_ДобавитьОшибку("В справочнике Договоры ОПС уже существует договор с номером "+СокрЛП(НомерНовогоДоговора)+", зарегистрированный в этом же году.");
				// -ХМНПФ 15.04.17 Кучеров // ПроверитьНомерДоговораОПС() // Собираем ошибки при проведении документа
				#КонецВставки
				уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("В справочнике Договоры ОПС уже существует договор с номером "+СокрЛП(НомерНовогоДоговора)+", зарегистрированный в этом же году.",,Заголовок);
				Возврат Истина;
			КонецЕсли;
		Иначе
			Если (НайденнаяСсылка <> ДоговорОПС) и (НайденнаяСсылка<>Справочники.уп_ДоговорыОПС.ПустаяСсылка()) Тогда
				#Вставка
				// +ХМНПФ 15.04.17 Кучеров // ПроверитьНомерДоговораОПС() // Собираем ошибки при проведении документа
				ХМ_ДобавитьОшибку("В справочнике Договоры ОПС уже существует договор с номером "+СокрЛП(НомерНовогоДоговора)+", зарегистрированный в этом же году.");
				// -ХМНПФ 15.04.17 Кучеров // ПроверитьНомерДоговораОПС() // Собираем ошибки при проведении документа
				#КонецВставки
				уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("В справочнике Договоры ОПС уже существует договор с номером "+СокрЛП(НомерНовогоДоговора)+", зарегистрированный в этом же году.",,Заголовок);
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли КонтрольУникальности = 0 Тогда	
		НайденнаяСсылка = Справочники.уп_ДоговорыОПС.НайтиПоКоду(СокрЛП(НомерНовогоДоговора));
		Если НЕ ЗначениеЗаполнено(ДоговорОПС) Тогда
			Если НайденнаяСсылка<>Справочники.уп_ДоговорыОПС.ПустаяСсылка() Тогда
				#Вставка
				// +ХМНПФ 15.04.17 Кучеров // ПроверитьНомерДоговораОПС() // Собираем ошибки при проведении документа
				ХМ_ДобавитьОшибку("В справочнике Договоры ОПС уже существует договор или группа с номером "+СокрЛП(НомерНовогоДоговора));
				// -ХМНПФ 15.04.17 Кучеров // Собираем ошибки при проведении документа
				#КонецВставки
				уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("В справочнике Договоры ОПС уже существует договор или группа с номером "+СокрЛП(НомерНовогоДоговора),,Заголовок);
				Возврат Истина;
			КонецЕсли;
		Иначе
			Если (НайденнаяСсылка <> ДоговорОПС) и (НайденнаяСсылка<>Справочники.уп_ДоговорыОПС.ПустаяСсылка()) Тогда 
				#Вставка
				// +ХМНПФ 15.04.17 Кучеров // ПроверитьНомерДоговораОПС() // Собираем ошибки при проведении документа
				ХМ_ДобавитьОшибку("В справочнике Договоры ОПС уже существует договор или группа с номером "+СокрЛП(НомерНовогоДоговора));
				// -ХМНПФ 15.04.17 Кучеров // Собираем ошибки при проведении документа
				#КонецВставки
				уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("В справочнике Договоры ОПС уже существует договор или группа с номером "+СокрЛП(НомерНовогоДоговора),,Заголовок);
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

// +ХМНПФ 01.03.17 Кучеров// Новая Функция ХМ_ПечатьWeb()
// для получения печатных форм со стороны Web сервисов
// аналог процедуры печать типового варианта пользовательского интерфейса
Функция ХМ_ПечатьWeb(ИмяМакета) Экспорт
	ТабДокумент = Новый ТабличныйДокумент; // заглушка на случай если не сформируется ни чего 
	////Если      ИмяМакета = "Договор06022004" Тогда
	////	ТабДокумент = ПечатьДокумента("Договор");
	////ИначеЕсли ИмяМакета = "Договор03072006" Тогда
	////	ТабДокумент = ПечатьДокумента("Договор03072006");
	////ИначеЕсли ИмяМакета = "Договор19072010" Тогда
	////	ТабДокумент = ПечатьДоговора19072010("Договор19072010");
	////ИначеЕсли ИмяМакета = "Договор15052012" Тогда
	////	ТабДокумент = ПечатьДоговора15052012("Договор15052012");
	////ИначеЕсли ИмяМакета = "Договор03062013" Тогда
	////	ТабДокумент = ПечатьДоговора15052012("Договор03062013");
	////ИначеЕсли ИмяМакета = "Поручение" Тогда
	////	ТабДокумент = ПечатьПоручения();
	////ИначеЕсли ИмяМакета="ЗаявлениеПФРНПФ" Тогда
	////	ТабДокумент = ПечатьЗаявления("ПФР");
	////ИначеЕсли ИмяМакета="ЗаявлениеНПФНПФ" Тогда
	////	ТабДокумент = ПечатьЗаявления("НПФ");
	////КонецЕсли;
	
	Возврат ТабДокумент;
КонецФункции 

// +ХМНПФ 01.03.17 Кучеров// Новая Процедура ХМ_ДобавитьОшибку
Процедура ХМ_ДобавитьОшибку(ТекстОшибки)
	Если НЕ ДополнительныеСвойства.Свойство("МассивОшибок") Тогда
		ДополнительныеСвойства.Вставить("МассивОшибок",Новый Массив);
	Конецесли;
	дополнительныеСвойства.МассивОшибок.Добавить(ТекстОшибки);
КонецПроцедуры

Процедура ХМ_ЗАГРУЗКА_ОбработкаПроведения(Отказ, Режим, СтрокаТЗ, СтруктураТЧ) Экспорт
	Если ПометкаУдаления Тогда
		#Если Сервер Тогда
			// +ХМНПФ 06.07.2016 ШадринАВ // ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №396
			Движения.уп_ПредыдущиеСтраховщикиПоДоговорамОПС.Очистить();
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ПредыдущиеСтраховщикиПоДоговорамОПС);
			// -ХМНПФ 06.07.2016 ШадринАВ // ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №396
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_СостоянияДоговораОПС);
		#КонецЕсли
		Возврат;	
	КонецЕсли;

	Движение = Движения.уп_СостоянияДоговораОПС.Добавить();
	Движение.Период = Дата;
	Движение.ДоговорОПС = ДоговорОПС;
	Движение.Состояние = ?(Проведен,Перечисления.уп_СостоянияДоговоровОПС.ОжиданиеПодтвержденияПФР,Перечисления.уп_СостоянияДоговоровОПС.Заключен);
	
#Если Сервер Тогда
	ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_СостоянияДоговораОПС);
	// +ХМНПФ 06.07.2016 ШадринАВ // ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №396
	Если НЕ СтрокаТЗ.Владелец().Колонки.Найти("ПредыдущийСтраховщик")=Неопределено И НЕ ЗначениеЗаполнено(СтрокаТЗ.ПредыдущийСтраховщик) Тогда
		Движения.уп_ПредыдущиеСтраховщикиПоДоговорамОПС.Очистить();
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ПредыдущиеСтраховщикиПоДоговорамОПС);
	КонецЕсли;
	// -ХМНПФ 06.07.2016 ШадринАВ // ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №396
	// +ХМНПФ 20.10.2016 ШадринАВ // ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №601
	Если Движения.уп_ПредыдущиеСтраховщикиПоДоговорамОПС.Количество() = 1 
			И Движения.уп_ПредыдущиеСтраховщикиПоДоговорамОПС[0].ПредыдущийСтраховщик.Код = "00-000000000080" Тогда
		Движения.уп_ПредыдущиеСтраховщикиПоДоговорамОПС[0].ПредыдущийСтраховщик = Константы.уп_ПенсионныйФондРФ.Получить();
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ПредыдущиеСтраховщикиПоДоговорамОПС);
		ПредыдущийСтраховщик = Константы.уп_ПенсионныйФондРФ.Получить();
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(ЭтотОбъект);
	КонецЕсли;
	// -ХМНПФ 20.10.2016 ШадринАВ // ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №601
#КонецЕсли
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура ХМОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект);
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда 
		Если ДанныеЗаполнения.Свойство("ДанныеДоговора") Тогда
			Филиал   = ПолучитьФилиалПоПодразделению(ПодразделениеОрганизации);
			ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения.ДанныеДоговора);
			Если ДанныеЗаполнения.ДанныеДоговора.Свойство("МассивПравоприемников") Тогда
				Для каждого ЗН Из 	ДанныеЗаполнения.ДанныеДоговора.МассивПравоприемников Цикл
					НоваяСтрока = Правопреемники.Добавить();	
					ЗаполнитьЗначенияСвойств(НоваяСтрока,Зн);
					СтруктураСтроки = ПолучитьСтруктуруДляЗаполненияСтрокиПравоприемника(НоваяСтрока.ХМ_Правоприемник,Дата);
					ЗаполнитьЗначенияСвойств(НоваяСтрока,СтруктураСтроки);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	Конецесли;
КонецПроцедуры

Функция ПолучитьСтруктуруДляЗаполненияСтрокиПравоприемника(Клиент,Дата)
	СтруктураДанных = Новый Структура("Фамилия,Имя,Отчество,ДатаРождения");
	СтруктураДанных.Вставить("ДатаРождения",Клиент.уп_ФизЛицо.ДатаРождения);
	СтруктураДанных.Вставить("Пол",Клиент.уп_ФизЛицо.Пол);
	НЗ = РегистрыСведений.ФИОФизическихЛиц.СрезПервых(Дата,Новый Структура("ФизическоеЛицо",Клиент.уп_ФизЛицо));
	Если НЗ.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(СтруктураДанных,НЗ[0]);
	КонецЕсли;
	
	НЗ = РегистрыСведений.ДокументыФизическихЛиц.СрезПоследних(Дата,Новый Структура("ФизЛицо",Клиент.уп_ФизЛицо));
	Если НЗ.Количество() > 0 Тогда
		СтруктураДанных.Вставить("ВидДокумента",НЗ[0].ВидДокумента);
		СтруктураДанных.Вставить("ДокументСерия",НЗ[0].Серия);
		СтруктураДанных.Вставить("ДокументНомер",НЗ[0].Номер);
		СтруктураДанных.Вставить("ДокументДатаВыдачи",НЗ[0].ДатаВыдачи);
		СтруктураДанных.Вставить("ДокументКемВыдан",НЗ[0].КемВыдан);
		СтруктураДанных.Вставить("ДокументКодПодразделения",НЗ[0].КодПодразделения);
	КонецЕсли;
	
	СтруктураДанных.Вставить("СтраховойНомерПФР",Клиент.уп_ФизЛицо.СтраховойНомерПФР);
	Если ЗначениеЗаполнено(Клиент.уп_ФизЛицо) Тогда
		СтруктураДанных.Вставить("Адрес",Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица);
	Иначе
		СтруктураДанных.Вставить("Адрес",Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
	КонецЕсли;
	
	Возврат СтруктураДанных;
КонецФункции

Функция ПолучитьФилиалПоПодразделению(Подразделение)
	УстановитьПривилегированныйРежим(Истина);
	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		Возврат Справочники.уп_Филиалы.ПустаяСсылка();
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ
		|	уп_Филиалы.Код,
		|	уп_Филиалы.Ссылка
		|ИЗ
		|	Справочник.уп_Филиалы КАК уп_Филиалы
		|ГДЕ
		|	уп_Филиалы.Код = &Код
		|	И уп_Филиалы.Владелец = &Владелец" ;
		Запрос.УстановитьПараметр("Код",Подразделение.Код);
		Запрос.УстановитьПараметр("Владелец",Подразделение.Владелец);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		Иначе
			Фил = Справочники.уп_Филиалы.СоздатьЭлемент();
			Фил.Владелец = Подразделение.Владелец;
			Фил.Код = Подразделение.Код;
			Фил.Наименование = Подразделение.Наименование;
			Фил.ОбменДанными.Загрузка = Истина;
			Фил.Записать();
			Возврат Фил.Ссылка;
		Конецесли;
	Конецесли;
КонецФункции

Функция ПолучитьКонтактнуюИнформация(ОбъектКонтактнойИнформации,ВидКонтактнойИнформации)
	Об = ОбъектКонтактнойИнформации.ПолучитьОбъект();
	МассивСтрок = Об.КонтактнаяИнформация.НайтиСтроки(Новый Структура("ВидДляСписка",ВидКонтактнойИнформации));
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат "Не указано";
	Иначе
		Возврат МассивСтрок[0].Представление;
	КонецЕсли;	
КонецФункции 

// ХМНПФ 24.12.2020 ШадринАВ // ПолучитьКодФилиала() // №3039
Функция ПолучитьКодФилиала(Филиал)
	КодФилиала = "";
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НомераСтруктурныхПодразделений.Номер КАК Номер
		|ИЗ
		|	РегистрСведений.хм_НомераСтруктурныхПодразделений КАК НомераСтруктурныхПодразделений
		|ГДЕ
		|	НомераСтруктурныхПодразделений.Подразделение = &Филиал";
	
	Запрос.УстановитьПараметр("Филиал", Филиал);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КодФилиала = Прав("00"+Формат(Выборка.Номер,"ЧГ="),2);
	КонецЕсли;
	Возврат КодФилиала;
КонецФункции // ПолучитьКодФилиала(ОткрытиеДоговораОПС)
